In [2]:
import pandas as pd
pandas.__version__

'1.1.1'

Pandas Types:
    1. Series
    2. Dataframe

In [3]:
population_dict = {'California': 38332521, 'Texas': 26448193, 
                   'New York': 19651127, 'Florida': 19882860, 
                  'Illinois': 12662135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19882860
Illinois      12662135
dtype: int64

In [4]:
population['Texas' : 'Florida']

Texas       26448193
New York    19651127
Florida     19882860
dtype: int64

In [6]:
pd.DataFrame(population, columns = ['Population'])

            Population
California    38332521
Texas         26448193
New York      19651127
Florida       19882860
Illinois      12662135

In [16]:
data = [{'a': i, 'b': 2*i, 'c': 2+i} for i in range(20)]
df = pd.DataFrame(data)
df = df.rename(columns={'a': 'A', 'b': 'B'})
df

     A   B   c
0    0   0   2
1    1   2   3
2    2   4   4
3    3   6   5
4    4   8   6
5    5  10   7
6    6  12   8
7    7  14   9
8    8  16  10
9    9  18  11
10  10  20  12
11  11  22  13
12  12  24  14
13  13  26  15
14  14  28  16
15  15  30  17
16  16  32  18
17  17  34  19
18  18  36  20
19  19  38  21

In [17]:
pd.DataFrame([{'a': 2, 'b': 3}, {'b': 4, 'c':5}])

     a  b    c
0  2.0  3  NaN
1  NaN  4  5.0

In [20]:
import numpy as np
pd.DataFrame(np.random.rand(3, 2), columns = ['voo', 'foo'], 
             index = ['A', 'B', 'C'])

        voo       foo
A  0.457707  0.591306
B  0.848667  0.988151
C  0.591239  0.034731

Data Retrieval
    1. List of Dictionaries
    2.CSV Files
    3. Databases

In [23]:
d = [{'city': 'Delhi', 'data': 1000}, 
    {'city': 'Mumbai', 'data': 2000}, 
    {'city': 'Bangalore', 'data': 3000}]
pd.DataFrame(d)

        city  data
0      Delhi  1000
1     Mumbai  2000
2  Bangalore  3000

In [24]:
#CSV Files

data = pd.read_csv('RegularSeasonCompactResults.csv')
data

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [32]:
import cx_Oracle
server = 'xxxxxxx' #Address of database server
user = 'xxxxx' #Username
password = 'xxxxx' #password

conn = cx_Oracle.connect(server=server, user=user, password = password)

query = "select * from some_table"
data = pd.read_sql(query, conn)

DatabaseError: DPI-1047: Cannot locate a 64-bit Oracle Client library: "The specified module could not be found". See https://cx-oracle.readthedocs.io/en/latest/user_guide/installation.html for help

In [25]:
print(data.head())
print(data.tail())

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0
        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [26]:
data.shape

(145289, 8)

In [27]:
data.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [28]:
data.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [29]:
data.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  object
 7   Numot   145289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB

In [33]:
data['Lteam'].max()

1464

In [35]:
data['Lscore'].mean()

64.49700940883343

In [36]:
data['Wteam'].median()

1284.0

In [40]:
data['Lteam'].idxmax()

344

In [44]:
data['Wscore'].argmax()

24970

In [42]:
data['Season'].value_counts()

2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: Season, dtype: int64

# Accessing Values

In [46]:
#iloc[] function stands for integer-location

In [47]:
data.iloc[[data['Wscore'].argmax()]]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970    1991      68   1258     186   1109     140    H      0

In [48]:
data.iloc[[data['Wscore'].idxmax()]]['Wteam']

24970    1258
Name: Wteam, dtype: int64

In [49]:
print(type(data.iloc[[data['Wscore'].argmax()]]))

<class 'pandas.core.frame.DataFrame'>

In [50]:
print(type(data.iloc[[data['Wscore'].idxmax()]]['Wteam']))

<class 'pandas.core.series.Series'>

In [ ]:
#loc[] function stands for "purely label-based location"